#include "pwm.h"

/******************************************
 * 
 * 函数 :  fw_tc0Init
 *  * 功能 : PWM 初始化
 *
*******************************************/
#if 	TC0_ENABLE
void fw_tc0Init()
{
	//===========TC0初始化==============
	TC0CON = 0x00;	//TC0控制寄存器			0分频	
	TC0C = T_TC0;		//TC0计数寄存器
	INTE0 |= 0x01;			//中断使能 21
}
#endif
/******************************************
 * 
 * 函数 :  fw_pwm1Init()
 *  * 功能 : PWM 初始化
 *
*******************************************/
#if 	PWM1_ENABLE
void fw_pwm1Init()
{
//===========TC1(PWM1/PWM3)初始化============
		TC1CON = 0x80;		//TC1控制寄存器
		TC1PRDTH = 0x00;	//TC1（PWM1、PWM3）周期高位及PWM1占空比高4位		
		TC1PRDL = 100;		//TC1（PWM1、PWM3）周期低8位
		PWM1DTL = 50;		//PWM1占空比低8位
				
		PWMIS |= 0X00;			//PWM端口映射控制寄存器
		/*Bit<7>:IPWM4S-IPWM4 端口映射选择
		0:选择 P51 口输出
		1:选择 P62 口输出
		Bit<6>:PWM4S-PWM4 端口映射选择
		0:选择 P63 口输出
		1:选择 P55 口输出
		Bit<5>:IPWM3S-IPWM3 端口映射选择
		0:选择 P50 口输出
		1:选择 P61 口输出
		JZ8P2615 数据手册
		晶哲科技 www.wxjzkj.com
		改变从芯开始 用芯成就未来
		第 34 页 共 85 页
		Bit<4>:PWM3S-PWM3 端口映射选择
		0:选择 P62 口输出
		1:选择 P54 口输出
		Bit<3>:IPWM2S-IPWM2 端口映射选择
		0:选择 P67 口输出
		1:选择 P65 口输出
		Bit<2>:PWM2S-PWM2 端口映射选择
		0:选择 P61 口输出
		1:选择 P53 口输出
		Bit<1>:IPWM1S-IPWM1 端口映射选择
		0:选择 P66 口输出
		1:选择 P64 口输出
		Bit<0>:PWM1S-PWM1 端口映射选择
		0:选择 P60 口输出
		1:选择 P52 口输出*/
// //===========PWM死区控制初始化===========
// 		DEADCON = 0x00;		//死区控制寄存器
// 		DEADT0 = 0x00;		//死区时间控制寄存器0
// 		DEADT1 = 0x00;		//死区时间控制寄存器1
}
#endif
/******************************************
 * 
 * 函数 :  file_PWMint
 *  * 功能 : PWM 初始化
 *
*******************************************/
#if 	PWM2_ENABLE
void fw_pwm2Init()
{
//===========PWM初始化=======================
		PWMCON |= 0x00;		//PWM控制寄存器 bit7:PWM1/2级联,1:使能
			
//===========TC2(PWM2/PWM4)初始化===========
		TC2CON |= 0x80;		//TC2控制寄存器	
		TC2PRDTH = 0;		//TC2周期占空比高位寄存器
		TC2PRDL = 100;		//TC2（PWM2/PWM4）周期低8位		
		PWM2DTL = 0;		//PWM2占空比低位寄存器

		PWMIS |= 0X00;			//PWM端口映射控制寄存器
		/*Bit<7>:IPWM4S-IPWM4 端口映射选择
		0:选择 P51 口输出
		1:选择 P62 口输出
		Bit<6>:PWM4S-PWM4 端口映射选择
		0:选择 P63 口输出
		1:选择 P55 口输出
		Bit<5>:IPWM3S-IPWM3 端口映射选择
		0:选择 P50 口输出
		1:选择 P61 口输出
		JZ8P2615 数据手册
		晶哲科技 www.wxjzkj.com
		改变从芯开始 用芯成就未来
		第 34 页 共 85 页
		Bit<4>:PWM3S-PWM3 端口映射选择
		0:选择 P62 口输出
		1:选择 P54 口输出
		Bit<3>:IPWM2S-IPWM2 端口映射选择
		0:选择 P67 口输出
		1:选择 P65 口输出
		Bit<2>:PWM2S-PWM2 端口映射选择
		0:选择 P61 口输出
		1:选择 P53 口输出
		Bit<1>:IPWM1S-IPWM1 端口映射选择
		0:选择 P66 口输出
		1:选择 P64 口输出
		Bit<0>:PWM1S-PWM1 端口映射选择
		0:选择 P60 口输出
		1:选择 P52 口输出*/
// //===========PWM死区控制初始化===========
// 		DEADCON = 0x00;		//死区控制寄存器
// 		DEADT0 = 0x00;		//死区时间控制寄存器0
// 		DEADT1 = 0x00;		//死区时间控制寄存器1
}
#endif
/******************************************
 * 
 * 函数 :  fw_pwm3Init()
 *  * 功能 : PWM 初始化
 *
*******************************************/
#if 	PWM3_ENABLE
void fw_pwm3Init()
{
//===========TC1(PWM1/PWM3)初始化============
		TC1CON = 0x80;		//TC1控制寄存器
		TC1PRDTH = 0x00;	//TC1（PWM1、PWM3）周期高位及PWM1占空比高4位		
		TC1PRDL = 100;		//TC1（PWM1、PWM3）周期低8位
				
		PWM3DTH = 0x00;		//PWM3占空比高位寄存器		
		PWM3DTL = 40;		//PWM3占空比低位寄存器

		PWMIS |= 0X00;			//PWM端口映射控制寄存器
		/*Bit<7>:IPWM4S-IPWM4 端口映射选择
		0:选择 P51 口输出
		1:选择 P62 口输出
		Bit<6>:PWM4S-PWM4 端口映射选择
		0:选择 P63 口输出
		1:选择 P55 口输出
		Bit<5>:IPWM3S-IPWM3 端口映射选择
		0:选择 P50 口输出
		1:选择 P61 口输出
		JZ8P2615 数据手册
		晶哲科技 www.wxjzkj.com
		改变从芯开始 用芯成就未来
		第 34 页 共 85 页
		Bit<4>:PWM3S-PWM3 端口映射选择
		0:选择 P62 口输出
		1:选择 P54 口输出
		Bit<3>:IPWM2S-IPWM2 端口映射选择
		0:选择 P67 口输出
		1:选择 P65 口输出
		Bit<2>:PWM2S-PWM2 端口映射选择
		0:选择 P61 口输出
		1:选择 P53 口输出
		Bit<1>:IPWM1S-IPWM1 端口映射选择
		0:选择 P66 口输出
		1:选择 P64 口输出
		Bit<0>:PWM1S-PWM1 端口映射选择
		0:选择 P60 口输出
		1:选择 P52 口输出*/
// //===========PWM死区控制初始化===========
// 		DEADCON = 0x00;		//死区控制寄存器
// 		DEADT0 = 0x00;		//死区时间控制寄存器0
// 		DEADT1 = 0x00;		//死区时间控制寄存器1
}
#endif
#if 	PWM4_ENABLE
void fw_pwm4Init()
{
//===========PWM初始化=======================
		PWMCON |= 0x04;		//PWM控制寄存器 bit7:PWM1/2级联,1:使能
			
//===========TC2(PWM2/PWM4)初始化===========
		TC2CON |= 0x80;		//TC2控制寄存器	

		TC2PRDTH = 0;		//TC2周期占空比高位寄存器
		TC2PRDL = 23;		//TC2（PWM2/PWM4）周期低8位	

		PWM4DTH = 0;		//PWM4占空比高位寄存器
		PWM4DTL = 0;		//PWM4占空比低位寄存器142 200  197

		PWMIS |= 0X04;			//PWM端口映射控制寄存器
		/*Bit<7>:IPWM4S-IPWM4 端口映射选择
		0:选择 P51 口输出
		1:选择 P62 口输出
		Bit<6>:PWM4S-PWM4 端口映射选择
		0:选择 P63 口输出
		1:选择 P55 口输出
		Bit<5>:IPWM3S-IPWM3 端口映射选择
		0:选择 P50 口输出
		1:选择 P61 口输出
		JZ8P2615 数据手册
		晶哲科技 www.wxjzkj.com
		改变从芯开始 用芯成就未来
		第 34 页 共 85 页
		Bit<4>:PWM3S-PWM3 端口映射选择
		0:选择 P62 口输出
		1:选择 P54 口输出
		Bit<3>:IPWM2S-IPWM2 端口映射选择
		0:选择 P67 口输出
		1:选择 P65 口输出
		Bit<2>:PWM2S-PWM2 端口映射选择
		0:选择 P61 口输出
		1:选择 P53 口输出
		Bit<1>:IPWM1S-IPWM1 端口映射选择
		0:选择 P66 口输出
		1:选择 P64 口输出
		Bit<0>:PWM1S-PWM1 端口映射选择
		0:选择 P60 口输出
		1:选择 P52 口输出*/

// //===========PWM死区控制初始化===========
 		DEADCON |= 0x20;		//死区控制寄存器
// 		DEADT0 = 0x00;		//死区时间控制寄存器0
// 		DEADT1 = 0x00;		//死区时间控制寄存器1

}
#endif